package ex.practice.Feb27th;

public class Test02 {

	public static void main(String[] args) {
		// 1. 일반 변수의 이름을 지을 때 일반적인 명명규칙은 무었인가요?
		// a1 숫자 안됨 특수문자는 $,_만 관례로 첫 글자는 대문자이거나 카멜식으로 명명
		
		// 2. 기본 자료형에는 몇가지가 있나요?
		// a2. 3가지 정수형 실수형 논리형
		
		// 3. 기본 자료형 중 정수형에는 어떤 것들이 있나요?
		// a3. bar, char, int, long
		
		// 4. byte는 몇 비트(bit)로 되어 있나요?
		// a4. 4아니면 8인데  4

		// 5. int와 long중 어떤 타입이 더 큰 숫자를 처리할 수 있나요?
		// a5. int는 21억 근처까지 그보다 더 큰 수는 long으로 처리
		
		// 6. 소수점을 처리하는 타입은 어떤 것이 있나요?
		// a6. float, double
		
		// 7. char는 정수형인가요?
		// a7. true
		
		// 8. a라는 값을 char로 정의할 때 어떤 기호로 감싸주어야 하나요?
		// a8. char a = 'a'
		
		// 9. true와 false 두개의 값만을 가지는 타입은 어떤 것인가요?
		// a9. 논리형(Boolean), 비교형
		
		// 10. 코드를 기계가 이해할 수 있는 언어로 바꾸는 작업을 _컴파일_ 이라고 합니다.
		
		// 11. 자바로 만든 프로그램은 _JVM_이 설치 되어있으면 운영체제와 상관없이 실행 할 수 있습니다.
		
		// 12. 자바 개발을 위해 설치하는 자바 라이브러리를 JDK_라고 합니다.
		
		// 13. 자바 프로그램이 실행되는 자바 실행 환경을 __JRE__라고 합니다.
		
		// 14. Hello JAVA 라는 문장을 출력하는 코드를 만들어보세요.
		// a14. System.out.println("Hello JAVA");
		
		// 15. 'int타입 변수 year에 값 2024를 대입한다'를 의미하는 코드를 만들어 보세요.
		// a15. int year = 2024;
		
		// 16. 다음 중 적합하지 않은 변수 이름을 모두 고르세요.
		// ①2024   ②_hello   ③int   ④MAX_COUNT   ⑤numberOfBaby
		// a16. 1
		
		// 17. C/C++ 프로그램에서는 대소문자가 구별된다. 자바 프로그램은 어떠한가요?
		// a17. 자바 역시 대소문자 구분
		
		// 18. 자바에서 제공하는 기본형 데이터타입을 모두 나열하세요.
		// a18. Boolean, bar, char, int, long, float, double
		
		// 19. 2진수 "1011 1101"을 10진수, 8진수, 16진수로 표현하세요.
		// a19. 16진수 BD 8진수 476 10진수 189

		/* 20. double 형의 값을 float 형의 변수에 대입하려는 경우 에러가 발생한다. 
				발생하는 이유와 수행시키는 방법은 무엇인가요?
				보기) double d = 10.55555;
					float f = d; */
		// a20. 큰 타입에서 작은 타입으로의 변환인데 타입변환이 제대로 안이루어져서
		//		float f = (float)d;


 







	}

}
